chore: update docs and readme
